export const FIVE_ELEMENTS = ['목', '화', '토', '금', '수'];

export const CHAR_INFO: Record<string, { e: string, p: string }> = {
  '甲': { e: '목', p: '+' }, '乙': { e: '목', p: '-' }, '丙': { e: '화', p: '+' }, '丁': { e: '화', p: '-' }, '戊': { e: '토', p: '+' }, '己': { e: '토', p: '-' }, '庚': { e: '금', p: '+' }, '辛': { e: '금', p: '-' }, '壬': { e: '수', p: '+' }, '癸': { e: '수', p: '-' },
  '寅': { e: '목', p: '+' }, '卯': { e: '목', p: '-' }, '巳': { e: '화', p: '+' }, '午': { e: '화', p: '-' }, '辰': { e: '토', p: '+' }, '戌': { e: '토', p: '+' }, '丑': { e: '토', p: '-' }, '未': { e: '토', p: '-' }, '申': { e: '금', p: '+' }, '酉': { e: '금', p: '-' }, '亥': { e: '수', p: '+' }, '子': { e: '수', p: '-' }
};

export const HANJA_TO_HANGUL: Record<string, string> = {
  '甲': '갑', '乙': '을', '丙': '병', '丁': '정', '戊': '무', '己': '기', '庚': '경', '辛': '신', '壬': '임', '癸': '계',
  '子': '자', '丑': '축', '寅': '인', '卯': '묘', '辰': '진', '巳': '사', '午': '오', '未': '미', '申': '신', '酉': '유', '戌': '술', '亥': '해'
};

export const TEXT_COLORS: Record<string, string> = { 
  '목': 'text-emerald-500', 
  '화': 'text-rose-400', 
  '토': 'text-amber-500', 
  '금': 'text-slate-400', 
  '수': 'text-indigo-400' 
};

export const RELATION_MAP = {
  STEM_HAP: [['甲','己'], ['乙','庚'], ['丙','辛'], ['丁','壬'], ['戊','癸']],
  STEM_CHUNG: [['甲','庚'], ['乙','辛'], ['丙','壬'], ['丁','癸'], ['戊','甲'], ['己','乙']],
  BRANCH_HAP: [['子','丑'], ['寅','亥'], ['卯','戌'], ['辰','酉'], ['巳','申'], ['午','未']],
  BRANCH_CHUNG: [['子','午'], ['丑','未'], ['寅','申'], ['卯','酉'], ['辰','戌'], ['巳','亥']],
  BRANCH_WONJIN: [['子','未'], ['丑','午'], ['寅','酉'], ['卯','申'], ['辰','亥'], ['巳','戌']]
};